; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c4-s2-p2-a6)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 a4 a5 
          c0 c1 c2 c3 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l1-0 l1-1 l2-0 l2-1 l3-0 l3-1 
          p0 p1 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (AIRPLANE a4)
    (AIRPLANE a5)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (OBJ p0)
    (OBJ p1)
    (at t0 l0-1)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-1)
    (at t4 l0-1)
    (at p0 l3-0)
    (at p1 l2-0)
    (at a0 l2-0)
    (at a1 l2-0)
    (at a2 l0-0)
    (at a3 l2-0)
    (at a4 l2-0)
    (at a5 l3-0)
)
(:goal
    (and
        (at p0 l0-0)
        (at p1 l0-1)
    )
)
)

; plan
1. (load-airplane p1 a0 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 a0)
   goals met: 0 of 2
2. (load-airplane p0 a5 l3-0)
   deleted: (at p0 l3-0)
   added: (in p0 a5)
   goals met: 0 of 2
3. (fly-airplane a5 l3-0 l0-0)
   deleted: (at a5 l3-0)
   added: (at a5 l0-0)
   goals met: 0 of 2
4. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 0 of 2
5. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 2
6. (unload-airplane p0 a5 l0-0)
   deleted: (in p0 a5)
   added: (at p0 l0-0)
   goals met: 1 of 2
7. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 1 of 2
8. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 1 of 2
9. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 1 of 2
10. (unload-truck p1 t0 l0-1)
   deleted: (in p1 t0)
   added: (at p1 l0-1)
   goals met: 2 of 2
